// 1. Сделайте функцию, которая возвращает квадрат числа. Число передается параметром.

// function getSqr (a) {
//     return (a**2);
//     }

//     getSqr (7)
//     console.log (getSqr(7));



// 2.Сделайте функцию, которая возвращает сумму двух чисел.


// function getSum (a, b) {
//     return (a+b);
//     }

//     getSum(5, 2)
//     console.log (getSum(5, 2));

 


// 3. Сделайте функцию, которая отнимает от первого числа второе и делит на третье.

// function getDiv (a, b, c) {
//     return ((a - b)/c);
//     }

//     getDiv(10, 6, 4 )
//     console.log (getDiv(10, 6, 4));


// 4. Сделайте функцию, которая принимает параметром число от 1 до 7, а возвращает день недели на русском языке.

// function getStringDay(number) {
//   if (number === 1) {
//     return "Понедельник";
//   } else if (number === 2) {
//     return "Вторник";
//   } else if (number === 3) {
//     return "Среда";
//   } else if (number === 4) {
//     return " Четверг";
//   } else if (number === 5) {
//     return "Пятница";
//   } else if (number === 6) {
//     return "Суббота";
//   } else if (number === 7) {
//     return "Воскресенье";
//   }
// }

// console.log(getStringDay(7));




// 5. Сделайте функцию, которая параметрами принимает 2 числа. 
// Если эти числа равны - пусть функция вернет true, а если не равны - false.


// function getEqual(a, b) {
//     if (a === b) {
//       return "true";
//     } else if (a !== b) {
//       return "false";
//     } 
//   }
  
//   console.log(getEqual(5, 7));


// 6. Сделайте функцию, которая параметрами принимает 2 числа. 
// Если их сумма больше 10 - пусть вернет true, а если нет то - false.


// function getUnequal(a, b) {
//     if ((a + b)>10) {
//       return "true";
//     } else if ((a + b)<=10) {
//       return "false";
//     } 
//   }
  
//   console.log(getUnequal(5, 2));




//   7. Сделайте функцию, которая параметром принимает число 
//   и проверяет - отрицательное оно или нет. 
//   Если отрицательное - пусть функция вернет true, а если нет - false.


// function getCompare (a) {
//     if (a < 0) {
//       return "true";
//     } else if (a > 0) {
//       return "false";
//     } 
//   }
  
//   console.log(getCompare(7));




//   8. Сделайте функцию isNumberInRange, которая параметром принимает число и проверяет, 
// что оно больше нуля и меньше 10. 
// Если это так - пусть функция возвращает true, если не так - false.



// function isNumberInRange(a) {
//     if (a > 0 && a < 10) {
//         return "true";
//       } else if (a < 0 && a > 10) {
//         return "false";
//       } 
//     } 
    
    
//     console.log(isNumberInRange(7));
        
    




// 9. Создайте функцию rgb(), которая будет принимать три числовых аргумента 
// и возвращать строку вида «rgb(23,100,134)». 
// Если аргументы не заданы, считать их равными нулю. 
// Не проверять переменные на тип данных








// 10. Написать функцию, которая принимает в себя три параметра - число и две функции. 
// Первая переданная функция  возвращает возведенное в квадрат переданное число 
// и будет вызываться, если число четное. 
// Вторая переданная коллбэк-функция будет вызываться с переданным в нее числом , 
// если число нечетное, и будет возвращать число, увеличенное на 1.





// 11. Написать функцию mult(num1, num2 , num3) принимающую 3 числа. 
// Функцию перемножает num1 и num2 столько раз, 
// сколько указано в третьем аргументе num3. 
// Значения num1 и num2 по умолчанию 1,  num3 по умолчанию 2. 
 





// 12. Написать функцию, которая принимает 3 аргумента(каждый аргумент - 1 слово) 
// и возвращает строку с этими 3 словами, расположенными в алфавитном порядке.

